SOAAssignment11/SOAPMessages.txt

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns2:login xmlns:ns2="http://service.student.nju.edu/"><email>student@smail.nju.edu.cn</email><password>123</password></ns2:login></S:Body></S:Envelope>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><soap:Body><ns2:loginResponse xmlns:ns2="http://service.student.nju.edu/"><return><email>student@smail.nju.edu.cn</email><id>3</id><identity>student</identity><password>123</password></return></ns2:loginResponse></soap:Body></soap:Envelope>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns2:login xmlns:ns2="http://service.student.nju.edu/"><email>teacher@smail.nju.edu.cn</email><password>123</password></ns2:login></S:Body></S:Envelope>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><soap:Body><ns2:loginResponse xmlns:ns2="http://service.student.nju.edu/"><return><email>teacher@smail.nju.edu.cn</email><id>2</id><identity>teacher</identity><password>123</password></return></ns2:loginResponse></soap:Body></soap:Envelope>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns2:login xmlns:ns2="http://service.student.nju.edu/"><email>none@smail.nju.edu.cn</email><password>123</password></ns2:login></S:Body></S:Envelope>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><soap:Body><ns2:loginResponse xmlns:ns2="http://service.student.nju.edu/"><return><email>none@smail.nju.edu.cn</email><id>4</id><identity>none</identity><password>123</password></return></ns2:loginResponse></soap:Body></soap:Envelope>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns2:login xmlns:ns2="http://service.student.nju.edu/"><email>teacher@smail.nju.edu.cn</email><password>12</password></ns2:login></S:Body></S:Envelope>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><soap:Body><soap:Fault><faultcode>soap:Server</faultcode><faultstring>email or password wrong</faultstring><detail/></soap:Fault></soap:Body></soap:Envelope>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns2:login xmlns:ns2="http://service.student.nju.edu/"><email>teacher@smail.nju.edu.cn</email><password/></ns2:login></S:Body></S:Envelope>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><soap:Body><soap:Fault><faultcode>soap:Server</faultcode><faultstring>login</faultstring><detail/></soap:Fault></soap:Body></soap:Envelope>
